; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v6 - type_1 ?v2 - type_2)
 	      (pred_2 ?v3 - object ?v2 - type_2)
	      (pred_4 ?v6 - type_1 ?v1 - type_3)
	      (pred_3 ?v6 - type_1 ?v3 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v6 - type_1 ?v4 ?v7 - type_2)
       :precondition (and  (pred_1 ?v6 ?v4))
       :effect (and  (pred_1 ?v6 ?v7)
		     (not (pred_1 ?v6 ?v4))))

   (:action op_2
       :parameters (?v6 - type_1 ?v8 - object ?v5 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v5) (pred_1 ?v6 ?v5) (pred_4 ?v6 ?v1))
       :effect (and (pred_3 ?v6 ?v8 ?v1)
		    (not (pred_2 ?v8 ?v5)) 
		    (not (pred_4 ?v6 ?v1))))

   (:action op_3
       :parameters (?v6 - type_1 ?v8 - object ?v5 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v8 ?v1) (pred_1 ?v6 ?v5))
       :effect (and (pred_2 ?v8 ?v5)
		    (pred_4 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v8 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_07 obj_10 - type_3
obj_04 obj_01 obj_05 obj_03 - type_2
obj_08 obj_06 obj_09 - object)
(:init
(pred_1 obj_02 obj_03)
(pred_4 obj_02 obj_07)
(pred_4 obj_02 obj_10)
(pred_2 obj_08 obj_03)
(pred_2 obj_06 obj_04)
(pred_2 obj_09 obj_01)
)
(:goal
(and
(pred_2 obj_08 obj_04)
(pred_2 obj_06 obj_01)
(pred_2 obj_09 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_02 ?b obj_10))))
)
)

; plan
1. (op_2 obj_02 obj_08 obj_03 obj_07)
   deleted: (pred_2 obj_08 obj_03) (pred_4 obj_02 obj_07)
   added: (pred_3 obj_02 obj_08 obj_07)
   goals met: 0 of 3
2. (op_1 obj_02 obj_03 obj_04)
   deleted: (pred_1 obj_02 obj_03)
   added: (pred_1 obj_02 obj_04)
   goals met: 0 of 3
3. (op_3 obj_02 obj_08 obj_04 obj_07)
   deleted: (pred_3 obj_02 obj_08 obj_07)
   added: (pred_2 obj_08 obj_04) (pred_4 obj_02 obj_07)
   goals met: 1 of 3
4. (op_2 obj_02 obj_06 obj_04 obj_07)
   deleted: (pred_2 obj_06 obj_04) (pred_4 obj_02 obj_07)
   added: (pred_3 obj_02 obj_06 obj_07)
   goals met: 1 of 3
5. (op_1 obj_02 obj_04 obj_01)
   deleted: (pred_1 obj_02 obj_04)
   added: (pred_1 obj_02 obj_01)
   goals met: 1 of 3
6. (op_3 obj_02 obj_06 obj_01 obj_07)
   deleted: (pred_3 obj_02 obj_06 obj_07)
   added: (pred_2 obj_06 obj_01) (pred_4 obj_02 obj_07)
   goals met: 2 of 3
7. (op_2 obj_02 obj_09 obj_01 obj_07)
   deleted: (pred_2 obj_09 obj_01) (pred_4 obj_02 obj_07)
   added: (pred_3 obj_02 obj_09 obj_07)
   goals met: 2 of 3
8. (op_1 obj_02 obj_01 obj_05)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_05)
   goals met: 2 of 3
9. (op_3 obj_02 obj_09 obj_05 obj_07)
   deleted: (pred_3 obj_02 obj_09 obj_07)
   added: (pred_2 obj_09 obj_05) (pred_4 obj_02 obj_07)
   goals met: 3 of 3
